#+TITLE: Org notes mode

** Org notes id follow
#+begin_src emacs-lisp
(defcustom org-notes-protocol "org-notes"
  "Protocol identifier for pomodoro links."
  :group 'org-notes
  :type 'string)


(defun org-notes-follow (id)
  ; Följande parantes är basically: (add-to-list-local 'apollo/org-notes/point-history (point))
  (if (member (point) apollo/org-notes/point-history)
      apollo/org-notes/point-history
    (setq-local
     apollo/org-notes/point-history
     (cons (point) apollo/org-notes/point-history)))
  (org-id-goto id)
  (apollo/org-notes/narrow-to-id))


(org-link-set-parameters org-notes-protocol :follow #'org-notes-follow)

#+end_src

#+RESULTS:
| :follow | org-notes-follow |


** All Exercises progress
Progress variable
#+begin_src emacs-lisp
(setq apollo/org-notes/all-exercises-progress "No org-notes project")
#+end_src

#+begin_src emacs-lisp
(defun apollo/org-notes/all-exercises-progress-fetch () (interactive)
       (let* ((all-exercises (apollo/org-notes/get-all-exercises))
	      (total-exercises (length all-exercises))
	      (done-exercises (length (-filter (lambda (x) (string-equal "DONE" (nth 3 x))) all-exercises))))
	 ; We prevent division by zero by checking if all-exercises is non nil
	 (setq apollo/org-notes/all-exercises-progress (if all-exercises  (/ (* 1000 done-exercises) total-exercises) 0)))) 
;(apollo/org-notes/all-exercises-progress-fetch)
#+end_src

#+RESULTS:
: 0


** Org notes id follow
#+begin_src emacs-lisp
(defcustom org-notes-protocol "org-notes"
  "Protocol identifier for pomodoro links."
  :group 'org-notes
  :type 'string)


(defun org-notes-follow (id)
  ; Följande parantes är basically: (add-to-list-local 'org-notes/point-history (point))
  (if (member (point) org-notes/point-history)
      org-notes/point-history
    (setq-local
     org-notes/point-history
     (cons (point) org-notes/point-history)))
  (org-id-goto id)
  (org-notes/narrow-to-id))


(org-link-set-parameters org-notes-protocol :follow #'org-notes-follow)

#+end_src

#+RESULTS:
| :follow | org-notes-follow |


** All Exercises progress
Progress variable
#+begin_src emacs-lisp
(setq org-notes/all-exercises-progress "No org-notes project")
#+end_src

#+begin_src emacs-lisp
(defun org-notes/all-exercises-progress-fetch () (interactive)
       (let* ((all-exercises (org-notes/get-all-exercises))
	      (total-exercises (length all-exercises))
	      (done-exercises (length (-filter (lambda (x) (string-equal "DONE" (nth 3 x))) all-exercises))))
	 ; We prevent division by zero by checking if all-exercises is non nil
	 (setq org-notes/all-exercises-progress (if all-exercises  (/ (* 1000 done-exercises) total-exercises) 0)))) 
;(org-notes/all-exercises-progress-fetch)
#+end_src

#+RESULTS:
: 0


